#Дано число обозначающее день недели. Вывести его название и указать является ли он выходным.
n = int(input("Введите номер дня недели: "))

if 5 < n < 8:
    print("Да, выходной")
elif n >= 8 or n <= 0:
    print("Введен неправильный номер дня недели")
else:
    print("Нет, будний")
