#Вывести на экран числа от -N до N

n = 8
for i in range(-n, n+1):
    print(i, sep='', end=' ')