# Пользователь вводит список целочисленных значений, а так же верхнюю границу для вычисления ссумы. Программа вычисляет сумму, но за исключением тех, что ввел пользователь. Например [2, 5, 6] 10, сумма всех чисел от 1 до 10, но без 2, 5, 6
numbers = [int(i) for i in input('Введите числа через пробел: ').split()]
control_number = int(input('Введите верхнюю границу вычисления суммы: '))
total = 0
for i in range(1, control_number+1):
 if i in numbers:
  continue
 else:
  total +=i

print(total)



