# Напишите программу, в которой создается и отображается список содержащий степени двойки[2 в 0, 2 в 1 и.д.]. Размер списка задает пользователь.
size = int(input("Введите размер списка: "))
number = 2
list = [number**k for k in range(0, size)]
print(list)


