# Напишите программу, которая на основе списка из натуральных чисел формирует целое число.
# Число формируется "объединением" элементов списка.
# Например: [12, 3, 456, 78] --> 12345678
numbers = [12, 3, 456, 78]
total = ''
for i in numbers:
    total += str(i)
print(int(total))