# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

x1, y1 = int(input("Введите x1: ")), int(input("Введите y1: "))
x2, y2 = int(input("Введите x2: ")), int(input("Введите y2: "))

distance = ((x2 - x1)**2 + (y2 - y1)**2)**(1/2)

print(f"Расстояние между точками А({x1}, {y1}) и В({x2}, {y2}) -> {round(distance,2)}" )