#Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

x = int(input("Введите x: "))
y = int(input("Введите y: "))

if x > 0 and y > 0:
    print("Точка принадлежит ПЕРВОЙ четверти")
elif x < 0 and y > 0:
    print("Точка принадлежит ВТОРОЙ четверти")
elif x < 0 and y < 0:
    print("Точка принадлежит ТРЕТЬЕЙ четверти")
elif x > 0 and y < 0:
    print("Точка принадлежит ЧЕТВЕРТОЙ четверти")
else: print("Точка лежит на оси координат")