# 38. Напишите программу, удаляющую из текста все слова содержащие "абв".

text = str('абвольт (абв) — единица измерения электрического потенциала (напряжения),\
разности электрических потенциалов и электродвижущей силы (ЭДС) в СГСМ\
(абсолютной электромагнитной системе сантиметр-грамм-секунда). 1 абвольт\
равен 10–8 В. При разности потенциалов в 1 абвольт через сопротивление\
1 абом будет протекать ток силой 1 ампер. Для перемещения заряда величиной\
в 1 абкулон между двумя точками с разностью потенциалов 1 вольт требуется\
энергия в 1 эрг.')

search_text = 'абв'
print(f'Текст до обработки:\n{text}')
print(f'\nУдалаяем из текста слова содержащие: \'{search_text}\'\n')
lst = (" ".join([el for el in text.split() if search_text not in el]))
print(f'Текст после обработки:\n{lst}\n\n')


my_text = 'Напишите абв напиабв програбвмму программу, удаляющую из этого абв текста все вабвс слова, содерабващие содержащие "абв"'

def del_some_words(my_text):
    my_text = list(filter(lambda x: 'абв' not in x, my_text.split()))
    print(my_text)
    return " ".join(my_text)

my_text = del_some_words(my_text)
print(my_text)
