# В файле хранятся числа, нужно выбрать четные и
# составить список пар (число; квадрат числа).
# Пример: 1 2 3 5 8 15 23 38
# Получить: [(2, 4), (8, 64), (38, 1444)]

path = 'file.txt'  # путь к папке
f = open(path, 'r')  # откроем в режиме чтения
data = f.read() + " "  # считываю все что есть и добавляю пробел
f.close()  # закрываю чтение файла

numbers = []
while data != '':  # пробегаюсь по всей строке, пока строка не пустая
    space_pos = data.index(' ')  # ищю первую позицию пробела
    numbers.append(int(data[:space_pos]))  # беру все что есть с начала до позиции первого пробела
    data = data[space_pos + 1:]  # обновляю строку, убираю то, что уже обработали

even = []

for i in numbers:
    if not i % 2:
        even.append((i, i ** 2))

print(numbers)
print(even)
