# Модуль создания личности
from random import randint


def sex():
    sex = randint(0, 1)
    return "женщина" if sex == 0 else "мужчина"


def name(sex):
    man_name = [
        "Григорий", "Лев", "Андрей", "Роман", "Арсений", "Степан", "Владислав", "Никита", "Глеб", "Марк", "Давид",
        "Ярослав", "Евгений", "Матвей", "Фёдор", "Николай", "Алексей", "Андрей", "Артемий", "Виктор", "Никита",
        "Даниил", "Денис", "Егор", "Игорь", "Лев", "Леонид", "Павел", "Петр", "Роман", "Руслан", "Сергей", "Семён",
        "Тимофей", "Юрий", "Платон", "Денис", "Ярослав", "Мирон", "Серафим", "Спартак", "Марк", "Захар"
    ]
    women_name = [
        "Аврора", "Авигея", "Агата", "Агнесса", "Агния", "Беатриса", "Белла", "Береслава", "Берта", "Бенита",
        "Валентина", "Валерия", "Ванда", "Ванесса", "Варвара", "Василиса", "Венера", "Вера", "Верона",
        "Вероника", "Версавия", "Габриэлла", "Габи", "Гаянэ", "Гелана", "Гелена", "Гелла", "Гелианна", "Генриетта",
        "Георгина", "Герда", "Ева", "Евангелина", "Евгения", "Евдокия", "Екатерина", "Оксана", "Олеся", "Фаиза", "Фаина"
    ]
    return women_name[randint(0, len(women_name) - 1)] if sex == "женщина" else man_name[randint(0, len(man_name) - 1)]


def surname(sex):
    man_surname = [
        "Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов", "Лебедев", "Козлов", "Новиков", "Морозов", "Петров",
        "Волков", "Соловьёв", "Васильев", "Зайцев", "Павлов", "Семёнов", "Голубев", "Виноградов", "Богданов",
        "Воробьёв", "Фёдоров", "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров", "Орлов", "Киселёв", "Макаров",
        "Андреев"
    ]
    women_surname = [
        "Абрамова", "Акимова", "Аксенова", "Александрова", "Алексеева", "Андреева", "Анисимова",
        "Антонова", "Архипова", "Афанасьева", "Балашова", "Баранова", "Белова", "Белоусова", "Беляева",
        "Белякова", "Бирюкова", "Блинова", "Скворцова", "Смирнова", "Соболева", "Соколова", "Соловьева",
        "Сорокина", "Софронова", "Степанова", "Тарасова", "Терентьева", "Тимофеева", "Титова", "Устинова",
        "Ушакова", "Фадеева", "Федотова", "Филатова", "Харитонова", "Цветкова", "Чернова", "Чернышева",
        "Шишкина", "Щербакова", "Юдина", "Яковлева"
    ]

    return women_surname[randint(0, len(women_surname) - 1)] if sex == "женщина" else man_surname[
        randint(0, len(man_surname) - 1)]


def patronymic(sex):
    women_patronymic = [
        "Александровна", "Алексеевна", "Анатольевна", "Андреевна", "Антоновна",
        "Аркадьевна", "Арсеньевна", "Афанасьевна", "Даниловна", "Дмитриевна", "Богдановна",
        "Борисовна", "Ивановна", "Игоревна", "Ильинична", "Иосифовна", "Валентиновна",
        "Валериевна", "Васильевна", "Викторовна", "Владимировна", "Владиславовна",
        "Вячеславовна", "Геннадиевна", "Георгиевна", "Григорьевна", "Павловна",
        "Петровна", "Платоновна", "Яковлевна", "Ярославовна", "Федоровна",
        "Фелuксовна", "Филипповна",
    ]
    man_patronymic = [
        "Александрович", "Алексеевич", "Анатольевич", "Андреевич", "Антонович", "Вадимович", "Валентинович",
        "Валериевич", "Васильевич", "Викторович",
        "Давыдович", "Данилович", "Денисович", "Дмитриевич", "Евгеньевич", "Егорович",
        "Емельянович", "Ефимович", "Кириллович", "Константинович", "Корнеевич", "Макарович",
        "Максимович", "Маркович", "Матвеевич", "Митрофанович", "Михайлович", "Павлович",
        "Петрович", "Платонович", "Яковлевич", "Ярославович", "Юрьевич", "Савельевич",
        "Семенович", "Сергеевич", "Станиславович", "Степанович",
    ]

    return women_patronymic[randint(0, len(women_patronymic) - 1)] if sex == "женщина" else man_patronymic[
        randint(0, len(man_patronymic) - 1)]


def date_birth():
    month = randint(1, 12)
    if month in [1, 3, 5, 7, 8, 10, 12]:
        day = randint(1, 31)
    elif month == 2:
        day = randint(1, 28)
    else:
        day = randint(1, 30)
    year = randint(1965, 2003)
    return f"{day}.{month}.{year}"  # .format("%d-%m-%Y")


def phone():
    phone = "+7 9"
    for _ in range(8):
        phone += str(randint(0, 9))
    return phone
