# Модуль создания личности
from random import randint

def sex():
    sex = randint(0, 1)
    return "женщина" if sex == 0 else "мужчина"

def name(sex):
    man_name = [
        "Григорий", "Лев", "Андрей", "Роман", "Арсений", "Степан", "Владислав", "Никита", "Глеб", "Марк", "Давид",
        "Ярослав", "Евгений", "Матвей", "Фёдор", "Николай", "Алексей", "Андрей", "Артемий", "Виктор", "Никита",
        "Даниил", "Денис", "Егор", "Игорь", "Лев", "Леонид", "Павел", "Петр", "Роман", "Руслан", "Сергей", "Семён",
        "Тимофей", "Юрий", "Платон", "Денис", "Ярослав", "Мирон", "Серафим", "Спартак", "Марк", "Захар"
        ]
    women_name =[
        "Аврора", "Авигея", "Агата", "Агнесса", "Агния", "Беатриса", "Белла", "Береслава", "Берта", "Бенита",
        "Валентина", "Валерия", "Ванда", "Ванесса", "Варвара", "Василиса", "Венера", "Вера", "Верона",
        "Вероника", "Версавия", "Габриэлла", "Габи", "Гаянэ", "Гелана", "Гелена", "Гелла", "Гелианна", "Генриетта",
        "Георгина", "Герда", "Ева", "Евангелина", "Евгения", "Евдокия", "Екатерина", "Оксана", "Олеся", "Фаиза", "Фаина"
        ]

    man_surname = [
        "Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов", "Лебедев", "Козлов", "Новиков", "Морозов", "Петров",
        "Волков", "Соловьёв", "Васильев", "Зайцев", "Павлов", "Семёнов", "Голубев", "Виноградов", "Богданов",
        "Воробьёв", "Фёдоров", "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров", "Орлов", "Киселёв", "Макаров", "Андреев"
    ]
    women_surname = [ "Абрамова", "Акимова", "Аксенова", "Александрова", "Алексеева", "Андреева", "Анисимова",
                      "Антонова", "Архипова", "Афанасьева", "Балашова", "Баранова", "Белова", "Белоусова", "Беляева",
                      "Белякова", "Бирюкова", "Блинова", "Скворцова", "Смирнова", "Соболева", "Соколова", "Соловьева",
                      "Сорокина", "Софронова", "Степанова", "Тарасова", "Терентьева", "Тимофеева", "Титова", "Устинова",
                      "Ушакова", "Фадеева", "Федотова", "Филатова", "Харитонова", "Цветкова", "Чернова", "Чернышева",
                      "Шишкина", "Щербакова", "Юдина", "Яковлева"
                    ]

    if sex == "женщина":
        return women_surname[randint(0, len(women_surname)-1)], women_name[randint(0, len(women_name)-1)]
    else: return man_surname[randint(0, len(man_surname)-1)], man_name[randint(0, len(man_name)-1)]
