#Напишите программу, которая определяет, является ли год с данным номером високосным. Если год является високосным, то выведите «YES», иначе выведите «NO».
age = int(input())
if (age%4 == 0 and not age%100 == 0) or age% 400 == 0:
    print("YES")
else: print("NO")
