# Напишите программу, в которой создается и отображается список содержащий степени двойки[2 в 0, 2 в 1 и.д.]. Размер списка задает пользователь.
# size = int(input("Введите размер списка: "))
# number = 2
# list = [number**k for k in range(0, size)]
# print(list)

# Напишите программу, создающую список из чисел которые при делении на 5 дают в остатке 3. Отобразите список в прямом и обратном порядке.
size = int(input("Введите размер списка: "))
