# На вход программе подается натуральное число n, а затем n различных натуральных чисел, каждое на отдельной строке.
# Напишите программу, которая выводит наибольшее и второе наибольшее число последовательности.

n = int(input("Сколько чисел вы хотите ввести: "))
m1 = int(input())
m2 = 0
for i in range(n - 1):
    i = int(input())
    if i > m1:
        m2 = m1
        m1 = i
    if m1 > i and m2 < i:
        m2 = i
print("max", m1)
print("max2", m2)
