#Даны две различные клетки шахматной доски. Напишите программу, которая определяет, может ли ладья попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести «YES», если из первой клетки ходом ладьи можно попасть во вторую, или «NO» в противном случае.
n1, n2, n3, n4 = int(input()), int(input()), int(input()), int(input())
if (n1 != n3 and n2 == n4) or (n2 != n4 and n1 == n3):
    print("YES")
else: print("NO")
