# Задача Иосифа Флавия
# участвует n воинов и убивают каждого m-го
# решение через лист
def kill(list_people, step):
    if len(list_people) == 1:
        return list_people
    elif step > len(list_people):
        index = step - (len(list_people) * (step // len(list_people)))
        del list_people[index-1]
        if not index == 1:
            if index-1 < 0:
                people.append(people.pop(index - 1))
            else:
                people.extend(people[:index-1])
                del people[:index-1]
        return kill(list_people, step)
    else:
        del people[step - 1]
        people.extend(people[:step - 1])
        del people[:step - 1]
        return kill(list_people, step)


n, m = 498, 68

people = [i for i in range(1, n + 1)]


print(*kill(people, m))


# решение математикой
# логика:  динамический проход от конца к началу с нахождением положения
#
# 1. начинаем с конца - остается один персонаж - его позиция 0 (как позиция в массиве)
#
#     позиция 1 нельзя т.к. используем остаток от деления.
#
#  res - это позиция героя.
#
# 2. делаем шаг к началу (как шаг назад во времени) - персонажей уже двое, позиция нашего героя  (res + k) % i   где i  количество персонажей (здесь двое : res = (res + k) % 2)
#
# 3. следующий шаг назад во времени - персонажей трое... позиция героя : res = (res + k) % 3...
#
# 4. шагов n - 1 (один должен остаться) , используем  range(1, n+1) или точнее  range(2, n+1) т.к. начинаем с двух персонажей (но здесь единица ничего не меняет)
#
# 5. последний шаг - начальная позиция героя со сдвигом + 1 (т.к. используем остаток от деления или положение в массиве)
n = int(input())
k = int(input())

res = 0
for i in range(1, n + 1):
    res = (res + k) % i
print(res + 1)


# здесь i - количество людей в списке изначально res - позиция выжившего в списке
# (так как это смещение, то начинается с нуля) k = 2 У нас группа из 1 человека: [1] i = 1 res = 0
# Новое положение героя: res = (res+k)%i Подставляем: res = (0 + 2) % 1 = 0 (так как 2 делится нацело на 1) победит 1
# Теперь группа из 2 человек: [1,2] i = 2 res = 0 (это значение мы посчитали) res = (0 + 2) % 2 = 0 победит 1 Группа из 3
# человек: [1,2,3] i = 3 res = 0 res = (0 + 2) % 3 = 2 (следовательно, победит 3, так как мы считаем смещение, а в ответе
# должен быть номер человека) Группа из четырех человек: [1,2,3,4] i = 4 res = 2 res = (2 + 2) % 4 = 0 победит 1 Группа из
# 5 человек: [1,2,3,4,5] i = 5 res = 0 res = (0 + 2) % 5 = 2 победит 3 Группа из 6 человек: [1,2,3,4,5,6] i = 6 res = 2 res =
# (2 + 2) % 6 = 4 победит 5 и так далее
