# Ход ферзя
# Даны две различные клетки шахматной доски. Напишите программу,  которая определяет, может ли ферзь попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести «YES», если из первой клетки ходом ферзя можно попасть во вторую или «NO» в противном случае.

col1=int(input())
row1=int(input())
col2=int(input())
row2=int(input())
if (col1-row1 == col2 - row2) or (col1+row1 == col2 + row2):
    print("YES")
elif (col1 != col2 and row1 == row2) or (row1 != row2 and col1 == col2):
    print("YES")
else: print("NO")